test/loadtest.yml
config:
  target: "ws://192.168.56.1:8070"
  #target: "wss://fbwsim.th-brandenburg.de/ws"
  phases:
    - duration: 5 # 3 seconds
      arrivalRate: 10 # 1 user per second
      rampTo: 20 # 15 users per second
      name: "Ramping up the load"
  ws:
    # Ignore SSL certificate errors
    # - useful in *development* with self-signed certs
    rejectUnauthorized: false
scenarios:
  - name: Basic Game Engine Load Test
    engine: "ws"
    flow:
      #          player:
      #            name: "Rob the Bot"
      #            company: "Robotic Enterprises"
      - think: 5
      - send:
          type: "PLAYER_READY"  # Send the "ready" signal
      - think: 35   # Let the game engine run for a while