test/loadtest.yml
config:
  target: "ws://192.168.56.1:8070" #"wss://fbwsim.th-brandenburg.de/ws"
  phases:
    - duration: 5
      arrivalRate: 1 # Every second, add y users
      rampTo: 30 # Ramp it up to x users over the "duration"
      name: "Ramping up the load"
  ws:
    # Ignore SSL certificate errors
    # - useful in *development* with self-signed certs
    rejectUnauthorized: false
scenarios:
  - name: Basic Game Engine Load Test
    engine: "ws"
    flow:
      #          player:
      #            name: "Rob the Bot"
      #            company: "Robotic Enterprises"
      - think: 5
      - send:
          type: "PLAYER_READY"  # Send the "ready" signal
      - think: 35   # Let the game engine run for a while